{"class_name": "Model", "config": {"name": "model_71", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 7], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_72"}, "name": "input_72", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_284", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_284", "inbound_nodes": [[["input_72", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_285", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_285", "inbound_nodes": [[["conv2d_284", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_142", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_142", "inbound_nodes": [[["conv2d_285", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_286", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_286", "inbound_nodes": [[["max_pooling2d_142", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_287", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_287", "inbound_nodes": [[["conv2d_286", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_143", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_143", "inbound_nodes": [[["conv2d_287", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_71", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_71", "inbound_nodes": [[["max_pooling2d_143", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_213", "trainable": true, "dtype": "float32", "units": 48, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_213", "inbound_nodes": [[["flatten_71", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_214", "trainable": true, "dtype": "float32", "units": 32, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_214", "inbound_nodes": [[["dense_213", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_215", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_215", "inbound_nodes": [[["dense_214", 0, 0, {}]]]}], "input_layers": [["input_72", 0, 0]], "output_layers": [["dense_215", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}