{"class_name": "Model", "config": {"name": "model_75", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 7], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_76"}, "name": "input_76", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_300", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_300", "inbound_nodes": [[["input_76", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_301", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_301", "inbound_nodes": [[["conv2d_300", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_150", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_150", "inbound_nodes": [[["conv2d_301", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_302", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_302", "inbound_nodes": [[["max_pooling2d_150", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_303", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_303", "inbound_nodes": [[["conv2d_302", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_151", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_151", "inbound_nodes": [[["conv2d_303", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_75", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_75", "inbound_nodes": [[["max_pooling2d_151", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_225", "trainable": true, "dtype": "float32", "units": 48, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_225", "inbound_nodes": [[["flatten_75", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_226", "trainable": true, "dtype": "float32", "units": 32, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_226", "inbound_nodes": [[["dense_225", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_227", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_227", "inbound_nodes": [[["dense_226", 0, 0, {}]]]}], "input_layers": [["input_76", 0, 0]], "output_layers": [["dense_227", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}