{"class_name": "Model", "config": {"name": "model_110", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 7], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_111"}, "name": "input_111", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_440", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_440", "inbound_nodes": [[["input_111", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_441", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_441", "inbound_nodes": [[["conv2d_440", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_220", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_220", "inbound_nodes": [[["conv2d_441", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_442", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_442", "inbound_nodes": [[["max_pooling2d_220", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_443", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_443", "inbound_nodes": [[["conv2d_442", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_221", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_221", "inbound_nodes": [[["conv2d_443", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_110", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_110", "inbound_nodes": [[["max_pooling2d_221", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_330", "trainable": true, "dtype": "float32", "units": 48, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_330", "inbound_nodes": [[["flatten_110", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_331", "trainable": true, "dtype": "float32", "units": 32, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_331", "inbound_nodes": [[["dense_330", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_332", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_332", "inbound_nodes": [[["dense_331", 0, 0, {}]]]}], "input_layers": [["input_111", 0, 0]], "output_layers": [["dense_332", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}