{"class_name": "Model", "config": {"name": "model_105", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 7], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_106"}, "name": "input_106", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_420", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_420", "inbound_nodes": [[["input_106", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_421", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_421", "inbound_nodes": [[["conv2d_420", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_210", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_210", "inbound_nodes": [[["conv2d_421", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_422", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_422", "inbound_nodes": [[["max_pooling2d_210", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_423", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_423", "inbound_nodes": [[["conv2d_422", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_211", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_211", "inbound_nodes": [[["conv2d_423", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_105", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_105", "inbound_nodes": [[["max_pooling2d_211", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_315", "trainable": true, "dtype": "float32", "units": 48, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_315", "inbound_nodes": [[["flatten_105", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_316", "trainable": true, "dtype": "float32", "units": 32, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_316", "inbound_nodes": [[["dense_315", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_317", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_317", "inbound_nodes": [[["dense_316", 0, 0, {}]]]}], "input_layers": [["input_106", 0, 0]], "output_layers": [["dense_317", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}